function y = f(x)
    global A a
    x = floor(x);
    y = 0;
    H = A;
    m = 1;
    i=1;
    while true
        if(H(1,1) >= a(1))%长>=长
            if(H(1,2) >= a(1))%宽>=长
                if(x(i) == 1)%横放，横分
                    H(1,2) = H(1,2) - a(2);
                    
                    H = [[H(1,1)-a(1),a(2)];H];
                    if(H(1,1) < H(1,2))
                        H(1,:) = H(1,[2,1]);
                    end  
                elseif(x(i) == 2)%横放，竖分
                    H(1,1) = H(1,1) - a(1);
                    if(H(1,1) < H(1,2))
                        H(1,:) = H(1,[2,1]);
                    end  
                    
                    H = [[a(1),H(1,2) - a(2)];H];
                    if(H(1,1) < H(1,2))
                        H(1,:) = H(1,[2,1]);
                    end  
                elseif(x(i) == 3)%竖放，横分
                    H(1,2) = H(1,2) - a(1);
                    
                    H = [[H(1,1)-a(2),a(1)];H];
                    if(H(1,1) < H(1,2))
                        H(1,:) = H(1,[2,1]);
                    end  
                else%竖放，竖分
                    H(1,1) = H(1,1) - a(2);
                    if(H(1,1) < H(1,2))
                        H(1,:) = H(1,[2,1]);
                    end  
                    
                    H = [[a(2),H(1,2) - a(1)];H];
                    if(H(1,1) < H(1,2))
                        H(1,:) = H(1,[2,1]);
                    end  
                end
                i = i + 1;
                y = y + 1;
            else%宽<长
                if(H(1,2) >= a(2))%宽>=宽(只能横放)
                    if(mod(x(i),2) == 0)%如果是竖分
                        H(1,1) = H(1,1) - a(1);
                        if(H(1,1) < H(1,2))
                            H(1,:) = H(1,[2,1]);
                        end
                        
                        H = [[a(1),H(1,2) - a(2)];H];
                        if(H(1,1) < H(1,2))
                            H(1,:) = H(1,[2,1]);
                        end
                    else%横分
                        H(1,2) = H(1,2) - a(2);
                        
                        H = [[H(1,1)-a(1),a(2)];H];
                        if(H(1,1) < H(1,2))
                            H(1,:) = H(1,[2,1]);
                        end
                    end
                    i = i + 1;
                    y = y + 1;
                else%宽<宽(不能放)
                    m = m - 1;
                    if(m < 1)
                        break;
                    end
                    H(1,:) = [];
                end
            end
    
        else%长<长(不能放)
            m = m - 1;
            if(m < 1)
                break;
            end
            H(1,:) = [];
        end   
    end
    y = -y;
end
